{
  "texts": [
    "Les mathématiques derrière la théorie de la relativité d'Einstein sont complexes, mais fascinantes. La fameuse équation E=mc² montre que l'énergie (E) est égale à la masse (m) multipliée par la vitesse de la lumière (c) au carré. Cette découverte a bouleversé la physique moderne. En outre, la relativité restreinte introduit la dilatation du temps : plus un objet se déplace rapidement, plus le temps s’écoule lentement pour lui. C’est un phénomène vérifié par les horloges atomiques en orbite autour de la Terre !",

    "L’histoire de la cryptographie est remplie de mystères. Au cours de la Seconde Guerre mondiale, la machine Enigma, utilisée par les nazis, a chiffré des millions de messages secrets. Le mathématicien britannique Alan Turing a mené une équipe qui a finalement réussi à casser ce code. Ce triomphe, rendu possible grâce à des algorithmes complexes et des machines proto-informatiques, a été considéré comme un tournant décisif dans la guerre. Aujourd’hui, la cryptographie moderne utilise des techniques comme l’algorithme RSA pour protéger nos données sensibles sur Internet.",

    "La structure de l’ADN a été découverte en 1953 par James Watson et Francis Crick. Ce qui rend la molécule d'ADN si particulière, c'est sa double hélice composée de nucléotides. Chaque nucléotide se compose d'une base azotée (adénine, cytosine, guanine, thymine), d'un sucre et d’un groupe phosphate. La séquence de ces bases code l’information génétique nécessaire pour créer un organisme vivant. La biologie moléculaire moderne utilise ces principes pour manipuler les gènes via la technologie CRISPR.",

    "Les algorithmes de machine learning, tels que les réseaux de neurones artificiels, sont au cœur de l'intelligence artificielle (IA) moderne. Un réseau de neurones est composé de couches de nœuds, où chaque nœud représente un neurone qui effectue des calculs complexes. Les techniques de rétropropagation et d’optimisation de gradient sont utilisées pour ajuster les poids synaptiques et améliorer les performances du modèle. Ces technologies sous-tendent des applications comme la reconnaissance vocale, les voitures autonomes et bien plus encore !",

    "Les trous noirs sont des objets célestes si massifs que rien, pas même la lumière, ne peut échapper à leur attraction gravitationnelle. La première image directe d’un trou noir, située au centre de la galaxie M87, a été capturée en 2019 grâce à l’Event Horizon Telescope (EHT). Pour ce faire, les chercheurs ont dû combiner des signaux provenant de plusieurs télescopes à travers le globe, un exploit qui a nécessité des années de calculs complexes et une collaboration internationale inédite.",

    "Les fractales, ces objets mathématiques fascinants, possèdent une propriété unique : elles sont auto-similaires. Cela signifie que leur structure reste la même à n'importe quelle échelle d'observation. L'exemple le plus célèbre est l'ensemble de Mandelbrot, qui, lorsqu'il est agrandi, révèle des détails de plus en plus complexes. Les fractales sont utilisées dans des domaines aussi divers que la cartographie des côtes, la modélisation des forêts ou encore la compression d'images numériques."
  ]
}
