{
  "texts": [
    "En 1969, l’humanité a fait un pas géant avec l'alunissage d'Apollo 11. Neil Armstrong, le premier homme à marcher sur la Lune, a prononcé la célèbre phrase : « C'est un petit pas pour l’homme, un bond de géant pour l’humanité. » Cette mission a duré 8 jours, 3 heures et 18 minutes. Aujourd'hui, les missions spatiales continuent de repousser les limites, avec des projets ambitieux comme Mars 2024 et l’exploration des exoplanètes.",

    "Le cycle de l’eau est un processus essentiel qui se répète constamment. Il commence par l'évaporation de l'eau des océans et des lacs, suivie de la condensation des nuages, puis des précipitations (pluie ou neige). Chaque année, environ 500 000 km³ d'eau s’évaporent et reviennent sur Terre sous forme de précipitations. Une fois tombée, l'eau peut parcourir des milliers de kilomètres avant de rejoindre à nouveau les océans.",

    "L’invention de l’imprimerie par Johannes Gutenberg en 1450 a marqué un tournant dans l’histoire. Grâce à elle, les livres ont pu être produits en série, permettant la diffusion rapide des connaissances. Auparavant, il fallait des mois pour copier un livre à la main. Aujourd’hui, la technologie numérique permet d’imprimer des millions de livres chaque année en quelques jours seulement ! Gutenberg aurait-il imaginé une telle avancée ?",

    "Le soleil, notre étoile, se trouve à environ 149,6 millions de kilomètres de la Terre. Son diamètre est d’environ 1,39 million de kilomètres, soit 109 fois celui de la Terre. Chaque seconde, le soleil transforme environ 600 millions de tonnes d’hydrogène en hélium, produisant ainsi l'énergie qui soutient la vie sur notre planète. Imaginez que cette même étoile brillera encore pendant environ 5 milliards d’années avant de devenir une géante rouge !",

    "Le pont du Golden Gate à San Francisco est l’un des plus célèbres au monde. Achevé en 1937, il s’étend sur 2,7 km, avec une hauteur de 227 mètres. Ce pont est capable de résister à des vents de plus de 100 km/h et à de puissants tremblements de terre. Fait amusant : la couleur rouge-orange du pont n'était pas prévue à l'origine ! Elle a été choisie pour la rendre plus visible dans le brouillard dense de San Francisco.",

    "Les ordinateurs quantiques représentent la prochaine révolution technologique. Alors qu’un ordinateur classique utilise des bits, qui peuvent être soit 0 soit 1, un ordinateur quantique utilise des qubits, qui peuvent être 0, 1 ou une superposition des deux ! Cette capacité pourrait théoriquement permettre de résoudre des problèmes incroyablement complexes en un temps record. IBM et Google sont parmi les entreprises qui travaillent sur des prototypes, et qui sait, d’ici 10 ou 20 ans, ces machines pourraient devenir courantes."
  ]
}
